Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/soc_vectors.h
// For the core 0
// --------------

// Cortex_M55 Processor Exceptions Numbers

#define NonMaskableInt_C0_IRQn      NonMaskableInt_IRQn
#define HardFault_C0_IRQn           HardFault_IRQn
#define MemoryManagement_C0_IRQn    MemoryManagement_IRQn
#define BusFault_C0_IRQn            BusFault_IRQn
#define UsageFault_C0_IRQn          UsageFault_IRQn
#define SecureFault_C0_IRQn         SecureFault_IRQn
#define SVCall_C0_IRQn              SVCall_IRQn
#define DebugMonitor_C0_IRQn        DebugMonitor_IRQn
#define PendSV_C0_IRQn              PendSV_IRQn
#define SysTick_C0_IRQn             SysTick_IRQn

// SOC Specific Interrupt Numbers

#define PVD_C0_IRQn                 PVD_IRQn
#define DTS_C0_IRQn                 DTS_IRQn
#define LOCKUP_IT_C0_IRQn           LOCKUP_IT_IRQn
#define CACHE_ECC_C0_IRQn           CACHE_ECC_IRQn
#define TCM_ECC_C0_IRQn             TCM_ECC_IRQn
#define RAMCFG_C0_IRQn              RAMCFG_IRQn
#define FPU_C0_IRQn                 FPU_IRQn
#define RCC_S_C0_IRQn               RCC_S_IRQn
#define RTC_S_C0_IRQn               RTC_S_IRQn
#define TAMP_C0_IRQn                TAMP_IRQn
#define NVM_S_C0_IRQn               NVM_S_IRQn
#define RIFSC_TAMPER_C0_IRQn        RIFSC_TAMPER_IRQn
#define IAC_C0_IRQn                 IAC_IRQn
#define RCC_C0_IRQn                 RCC_IRQn
#define RTC_C0_IRQn                 RTC_IRQn
#define NVM_C0_IRQn                 NVM_IRQn
#define IWDG_C0_IRQn                IWDG_IRQn
#define WWDG_C0_IRQn                WWDG_IRQn
#define EXTI0_C0_IRQn               EXTI0_IRQn
#define EXTI1_C0_IRQn               EXTI1_IRQn
#define EXTI2_C0_IRQn               EXTI2_IRQn
#define EXTI3_C0_IRQn               EXTI3_IRQn
#define EXTI4_C0_IRQn               EXTI4_IRQn
#define EXTI5_C0_IRQn               EXTI5_IRQn
#define EXTI6_C0_IRQn               EXTI6_IRQn
#define EXTI7_C0_IRQn               EXTI7_IRQn
#define EXTI8_C0_IRQn               EXTI8_IRQn
#define EXTI9_C0_IRQn               EXTI9_IRQn
#define EXTI10_C0_IRQn              EXTI10_IRQn
#define EXTI11_C0_IRQn              EXTI11_IRQn
#define EXTI12_C0_IRQn              EXTI12_IRQn
#define EXTI13_C0_IRQn              EXTI13_IRQn
#define EXTI14_C0_IRQn              EXTI14_IRQn
#define EXTI15_C0_IRQn              EXTI15_IRQn
#define SAES_C0_IRQn                SAES_IRQn
#define CRYP_C0_IRQn                CRYP_IRQn
#define PKA_C0_IRQn                 PKA_IRQn
#define HASH_C0_IRQn                HASH_IRQn
#define RNG_C0_IRQn                 RNG_IRQn
#define MCE1_C0_IRQn                MCE1_IRQn
#define MCE2_C0_IRQn                MCE2_IRQn
#define MCE3_C0_IRQn                MCE3_IRQn
#define DCMIPP_C0_IRQn              DCMIPP_IRQn
#define ADC1_C0_IRQn                ADC1_IRQn
#define ADC2_C0_IRQn                ADC2_IRQn
#define ADC3_C0_IRQn                ADC3_IRQn
#define DAC_C0_IRQn                 DAC_IRQn
#define LCD_S_C0_IRQn               LCD_S_IRQn
#define LCD_ERR_S_C0_IRQn           LCD_ERR_S_IRQn
#define LCD_C0_IRQn                 LCD_IRQn
#define LCD_ERR_C0_IRQn             LCD_ERR_IRQn
#define DMA2D_C0_IRQn               DMA2D_IRQn
#define JPEG_C0_IRQn                JPEG_IRQn
#define GFXMMU_S_C0_IRQn            GFXMMU_S_IRQn
#define GFXMMU_C0_IRQn              GFXMMU_IRQn
#define GFXTIM_C0_IRQn              GFXTIM_IRQn
#define HPDMA1_CH0_C0_IRQn          HPDMA1_CH0_IRQn
#define HPDMA1_CH1_C0_IRQn          HPDMA1_CH1_IRQn
#define HPDMA1_CH2_C0_IRQn          HPDMA1_CH2_IRQn
#define HPDMA1_CH3_C0_IRQn          HPDMA1_CH3_IRQn
#define HPDMA1_CH4_C0_IRQn          HPDMA1_CH4_IRQn
#define HPDMA1_CH5_C0_IRQn          HPDMA1_CH5_IRQn
#define HPDMA1_CH6_C0_IRQn          HPDMA1_CH6_IRQn
#define HPDMA1_CH7_C0_IRQn          HPDMA1_CH7_IRQn
#define HPDMA1_CH8_C0_IRQn          HPDMA1_CH8_IRQn
#define HPDMA1_CH9_C0_IRQn          HPDMA1_CH9_IRQn
#define HPDMA1_CH10_C0_IRQn         HPDMA1_CH10_IRQn
#define HPDMA1_CH11_C0_IRQn         HPDMA1_CH11_IRQn
#define HPDMA1_CH12_C0_IRQn         HPDMA1_CH12_IRQn
#define HPDMA1_CH13_C0_IRQn         HPDMA1_CH13_IRQn
#define HPDMA1_CH14_C0_IRQn         HPDMA1_CH14_IRQn
#define HPDMA1_CH15_C0_IRQn         HPDMA1_CH15_IRQn
#define GPDMA1_CH0_C0_IRQn          GPDMA1_CH0_IRQn
#define GPDMA1_CH1_C0_IRQn          GPDMA1_CH1_IRQn
#define GPDMA1_CH2_C0_IRQn          GPDMA1_CH2_IRQn
#define GPDMA1_CH3_C0_IRQn          GPDMA1_CH3_IRQn
#define GPDMA1_CH4_C0_IRQn          GPDMA1_CH4_IRQn
#define GPDMA1_CH5_C0_IRQn          GPDMA1_CH5_IRQn
#define GPDMA1_CH6_C0_IRQn          GPDMA1_CH6_IRQn
#define GPDMA1_CH7_C0_IRQn          GPDMA1_CH7_IRQn
#define GPDMA1_CH8_C0_IRQn          GPDMA1_CH8_IRQn
#define GPDMA1_CH9_C0_IRQn          GPDMA1_CH9_IRQn
#define GPDMA1_CH10_C0_IRQn         GPDMA1_CH10_IRQn
#define GPDMA1_CH11_C0_IRQn         GPDMA1_CH11_IRQn
#define GPDMA2_CH0_C0_IRQn          GPDMA2_CH0_IRQn
#define GPDMA2_CH1_C0_IRQn          GPDMA2_CH1_IRQn
#define GPDMA2_CH2_C0_IRQn          GPDMA2_CH2_IRQn
#define GPDMA2_CH3_C0_IRQn          GPDMA2_CH3_IRQn
#define GPDMA2_CH4_C0_IRQn          GPDMA2_CH4_IRQn
#define GPDMA2_CH5_C0_IRQn          GPDMA2_CH5_IRQn
#define GPDMA2_CH6_C0_IRQn          GPDMA2_CH6_IRQn
#define GPDMA2_CH7_C0_IRQn          GPDMA2_CH7_IRQn
#define GPDMA2_CH8_C0_IRQn          GPDMA2_CH8_IRQn
#define GPDMA2_CH9_C0_IRQn          GPDMA2_CH9_IRQn
#define GPDMA2_CH10_C0_IRQn         GPDMA2_CH10_IRQn
#define GPDMA2_CH11_C0_IRQn         GPDMA2_CH11_IRQn
#define I2C1_EV_C0_IRQn             I2C1_EV_IRQn
#define I2C1_ER_C0_IRQn             I2C1_ER_IRQn
#define I2C2_EV_C0_IRQn             I2C2_EV_IRQn
#define I2C2_ER_C0_IRQn             I2C2_ER_IRQn
#define I2C3_EV_C0_IRQn             I2C3_EV_IRQn
#define I2C3_ER_C0_IRQn             I2C3_ER_IRQn
#define I3C1_EV_C0_IRQn             I3C1_EV_IRQn
#define I3C1_ER_C0_IRQn             I3C1_ER_IRQn
#define I3C2_EV_C0_IRQn             I3C2_EV_IRQn
#define I3C2_ER_C0_IRQn             I3C2_ER_IRQn
#define TIM1_BRK_C0_IRQn            TIM1_BRK_IRQn
#define TIM1_UP_C0_IRQn             TIM1_UP_IRQn
#define TIM1_TRG_COM_C0_IRQn        TIM1_TRG_COM_IRQn
#define TIM1_CC_C0_IRQn             TIM1_CC_IRQn
#define TIM2_C0_IRQn                TIM2_IRQn
#define TIM3_C0_IRQn                TIM3_IRQn
#define TIM4_C0_IRQn                TIM4_IRQn
#define TIM5_C0_IRQn                TIM5_IRQn
#define TIM6_C0_IRQn                TIM6_IRQn
#define TIM7_C0_IRQn                TIM7_IRQn
#define TIM8_BRK_C0_IRQn            TIM8_BRK_IRQn
#define TIM8_UP_C0_IRQn             TIM8_UP_IRQn
#define TIM8_TRG_COM_C0_IRQn        TIM8_TRG_COM_IRQn
#define TIM8_CC_C0_IRQn             TIM8_CC_IRQn
#define TIM9_C0_IRQn                TIM9_IRQn
#define TIM10_C0_IRQn               TIM10_IRQn
#define TIM12_C0_IRQn               TIM12_IRQn
#define TIM13_C0_IRQn               TIM13_IRQn
#define TIM14_C0_IRQn               TIM14_IRQn
#define TIM15_C0_IRQn               TIM15_IRQn
#define TIM16_C0_IRQn               TIM16_IRQn
#define TIM17_C0_IRQn               TIM17_IRQn
#define TIM20_BRK_C0_IRQn           TIM20_BRK_IRQn
#define TIM20_UP_C0_IRQn            TIM20_UP_IRQn
#define TIM20_TRG_COM_C0_IRQn       TIM20_TRG_COM_IRQn
#define TIM20_CC_C0_IRQn            TIM20_CC_IRQn
#define LPTIM1_C0_IRQn              LPTIM1_IRQn
#define LPTIM2_C0_IRQn              LPTIM2_IRQn
#define LPTIM3_C0_IRQn              LPTIM3_IRQn
#define LPTIM4_C0_IRQn              LPTIM4_IRQn
#define LPTIM5_C0_IRQn              LPTIM5_IRQn
#define HRTIM1_M_C0_IRQn            HRTIM1_M_IRQn
#define HRTIM1_TIMA_C0_IRQn         HRTIM1_TIMA_IRQn
#define HRTIM1_TIMB_C0_IRQn         HRTIM1_TIMB_IRQn
#define HRTIM1_TIMC_C0_IRQn         HRTIM1_TIMC_IRQn
#define HRTIM1_TIMD_C0_IRQn         HRTIM1_TIMD_IRQn
#define HRTIM1_TIME_C0_IRQn         HRTIM1_TIME_IRQn
#define HRTIM1_TIMF_C0_IRQn         HRTIM1_TIMF_IRQn
#define HRTIM1_FLT_C0_IRQn          HRTIM1_FLT_IRQn
#define ADF1_FLT0_C0_IRQn           ADF1_FLT0_IRQn
#define MDF1_FLT0_C0_IRQn           MDF1_FLT0_IRQn
#define MDF1_FLT1_C0_IRQn           MDF1_FLT1_IRQn
#define MDF1_FLT2_C0_IRQn           MDF1_FLT2_IRQn
#define MDF1_FLT3_C0_IRQn           MDF1_FLT3_IRQn
#define MDF1_FLT4_C0_IRQn           MDF1_FLT4_IRQn
#define MDF1_FLT5_C0_IRQn           MDF1_FLT5_IRQn
#define SAI1_A_C0_IRQn              SAI1_A_IRQn
#define SAI1_B_C0_IRQn              SAI1_B_IRQn
#define SAI2_A_C0_IRQn              SAI2_A_IRQn
#define SAI2_B_C0_IRQn              SAI2_B_IRQn
#define SPDIFRX1_C0_IRQn            SPDIFRX1_IRQn
#define SPI1_C0_IRQn                SPI1_IRQn
#define SPI2_C0_IRQn                SPI2_IRQn
#define SPI3_C0_IRQn                SPI3_IRQn
#define SPI4_C0_IRQn                SPI4_IRQn
#define SPI5_C0_IRQn                SPI5_IRQn
#define SPI6_C0_IRQn                SPI6_IRQn
#define USART1_C0_IRQn              USART1_IRQn
#define USART2_C0_IRQn              USART2_IRQn
#define USART3_C0_IRQn              USART3_IRQn
#define UART4_C0_IRQn               UART4_IRQn
#define UART5_C0_IRQn               UART5_IRQn
#define USART6_C0_IRQn              USART6_IRQn
#define UART7_C0_IRQn               UART7_IRQn
#define UART8_C0_IRQn               UART8_IRQn
#define UART9_C0_IRQn               UART9_IRQn
#define USART10_C0_IRQn             USART10_IRQn
#define LPUART1_C0_IRQn             LPUART1_IRQn
#define CEC_C0_IRQn                 CEC_IRQn
#define XSPI1_C0_IRQn               XSPI1_IRQn
#define XSPI2_C0_IRQn               XSPI2_IRQn
#define FMC_C0_IRQn                 FMC_IRQn
#define SDMMC1_C0_IRQn              SDMMC1_IRQn
#define SDMMC2_C0_IRQn              SDMMC2_IRQn
#define UCPD1_C0_IRQn               UCPD1_IRQn
#define OTG1_C0_IRQn                OTG1_IRQn
#define OTG_FS_C0_IRQn              OTG_FS_IRQn
#define ETH1_C0_IRQn                ETH1_IRQn
#define FDCAN1_IT0_C0_IRQn          FDCAN1_IT0_IRQn
#define FDCAN1_IT1_C0_IRQn          FDCAN1_IT1_IRQn
#define FDCAN2_IT0_C0_IRQn          FDCAN2_IT0_IRQn
#define FDCAN2_IT1_C0_IRQn          FDCAN2_IT1_IRQn
#define FDCAN3_IT0_C0_IRQn          FDCAN3_IT0_IRQn
#define FDCAN3_IT1_C0_IRQn          FDCAN3_IT1_IRQn
#define FDCAN_CU_C0_IRQn            FDCAN_CU_IRQn
#define MDIOS_C0_IRQn               MDIOS_IRQn
#define PSSI_C0_IRQn                PSSI_IRQn
#define WKUP_C0_IRQn                WKUP_IRQn
#define LSECSS_C0_IRQn              LSECSS_IRQn
#define CORDIC_C0_IRQn              CORDIC_IRQn
#define FMAC_C0_IRQn                FMAC_IRQn
#define HSEM_S_C0_IRQn              HSEM_S_IRQn
#define HSEM__C0_IRQn               HSEM__IRQn
#define CTI_IT0_C0_IRQn             CTI_IT0_IRQn
#define CTI_IT1_C0_IRQn             CTI_IT1_IRQn
#define CRS_C0_IRQn                 CRS_IRQn
#define SBS_S_C0_IRQn               SBS_S_IRQn
#define SBS_C0_IRQn                 SBS_IRQn

// Prototypes

#if (defined(__cplusplus))
extern  "C" {
#endif

// Exceptions

void    NonMaskableInt_C0_IRQHandler(void);
void    HardFault_C0_IRQHandler(void);
void    MemoryManagement_C0_IRQHandler(void);
void    BusFault_C0_IRQHandler(void);
void    UsageFault_C0_IRQHandler(void);
void    SecureFault_C0_IRQHandler(void);
void    SVCall_C0_IRQHandler(void);
void    DebugMonitor_C0_IRQHandler(void);
void    PendSV_C0_IRQHandler(void);
void    SysTick_C0_IRQHandler(void);

// IRQHandler

void    PVD_C0_IRQHandler(void);
void    DTS_C0_IRQHandler(void);
void    LOCKUP_IT_C0_IRQHandler(void);
void    CACHE_ECC_C0_IRQHandler(void);
void    TCM_ECC_C0_IRQHandler(void);
void    RAMCFG_C0_IRQHandler(void);
void    FPU_C0_IRQHandler(void);
void    RCC_S_C0_IRQHandler(void);
void    RTC_S_C0_IRQHandler(void);
void    TAMP_C0_IRQHandler(void);
void    NVM_S_C0_IRQHandler(void);
void    RIFSC_TAMPER_C0_IRQHandler(void);
void    IAC_C0_IRQHandler(void);
void    RCC_C0_IRQHandler(void);
void    RTC_C0_IRQHandler(void);
void    NVM_C0_IRQHandler(void);
void    IWDG_C0_IRQHandler(void);
void    WWDG_C0_IRQHandler(void);
void    EXTI0_C0_IRQHandler(void);
void    EXTI1_C0_IRQHandler(void);
void    EXTI2_C0_IRQHandler(void);
void    EXTI3_C0_IRQHandler(void);
void    EXTI4_C0_IRQHandler(void);
void    EXTI5_C0_IRQHandler(void);
void    EXTI6_C0_IRQHandler(void);
void    EXTI7_C0_IRQHandler(void);
void    EXTI8_C0_IRQHandler(void);
void    EXTI9_C0_IRQHandler(void);
void    EXTI10_C0_IRQHandler(void);
void    EXTI11_C0_IRQHandler(void);
void    EXTI12_C0_IRQHandler(void);
void    EXTI13_C0_IRQHandler(void);
void    EXTI14_C0_IRQHandler(void);
void    EXTI15_C0_IRQHandler(void);
void    SAES_C0_IRQHandler(void);
void    CRYP_C0_IRQHandler(void);
void    PKA_C0_IRQHandler(void);
void    HASH_C0_IRQHandler(void);
void    RNG_C0_IRQHandler(void);
void    MCE1_C0_IRQHandler(void);
void    MCE2_C0_IRQHandler(void);
void    MCE3_C0_IRQHandler(void);
void    DCMIPP_C0_IRQHandler(void);
void    ADC1_C0_IRQHandler(void);
void    ADC2_C0_IRQHandler(void);
void    ADC3_C0_IRQHandler(void);
void    DAC_C0_IRQHandler(void);
void    LCD_S_C0_IRQHandler(void);
void    LCD_ERR_S_C0_IRQHandler(void);
void    LCD_C0_IRQHandler(void);
void    LCD_ERR_C0_IRQHandler(void);
void    DMA2D_C0_IRQHandler(void);
void    JPEG_C0_IRQHandler(void);
void    GFXMMU_S_C0_IRQHandler(void);
void    GFXMMU_C0_IRQHandler(void);
void    GFXTIM_C0_IRQHandler(void);
void    HPDMA1_CH0_C0_IRQHandler(void);
void    HPDMA1_CH1_C0_IRQHandler(void);
void    HPDMA1_CH2_C0_IRQHandler(void);
void    HPDMA1_CH3_C0_IRQHandler(void);
void    HPDMA1_CH4_C0_IRQHandler(void);
void    HPDMA1_CH5_C0_IRQHandler(void);
void    HPDMA1_CH6_C0_IRQHandler(void);
void    HPDMA1_CH7_C0_IRQHandler(void);
void    HPDMA1_CH8_C0_IRQHandler(void);
void    HPDMA1_CH9_C0_IRQHandler(void);
void    HPDMA1_CH10_C0_IRQHandler(void);
void    HPDMA1_CH11_C0_IRQHandler(void);
void    HPDMA1_CH12_C0_IRQHandler(void);
void    HPDMA1_CH13_C0_IRQHandler(void);
void    HPDMA1_CH14_C0_IRQHandler(void);
void    HPDMA1_CH15_C0_IRQHandler(void);
void    GPDMA1_CH0_C0_IRQHandler(void);
void    GPDMA1_CH1_C0_IRQHandler(void);
void    GPDMA1_CH2_C0_IRQHandler(void);
void    GPDMA1_CH3_C0_IRQHandler(void);
void    GPDMA1_CH4_C0_IRQHandler(void);
void    GPDMA1_CH5_C0_IRQHandler(void);
void    GPDMA1_CH6_C0_IRQHandler(void);
void    GPDMA1_CH7_C0_IRQHandler(void);
void    GPDMA1_CH8_C0_IRQHandler(void);
void    GPDMA1_CH9_C0_IRQHandler(void);
void    GPDMA1_CH10_C0_IRQHandler(void);
void    GPDMA1_CH11_C0_IRQHandler(void);
void    GPDMA2_CH0_C0_IRQHandler(void);
void    GPDMA2_CH1_C0_IRQHandler(void);
void    GPDMA2_CH2_C0_IRQHandler(void);
void    GPDMA2_CH3_C0_IRQHandler(void);
void    GPDMA2_CH4_C0_IRQHandler(void);
void    GPDMA2_CH5_C0_IRQHandler(void);
void    GPDMA2_CH6_C0_IRQHandler(void);
void    GPDMA2_CH7_C0_IRQHandler(void);
void    GPDMA2_CH8_C0_IRQHandler(void);
void    GPDMA2_CH9_C0_IRQHandler(void);
void    GPDMA2_CH10_C0_IRQHandler(void);
void    GPDMA2_CH11_C0_IRQHandler(void);
void    I2C1_EV_C0_IRQHandler(void);
void    I2C1_ER_C0_IRQHandler(void);
void    I2C2_EV_C0_IRQHandler(void);
void    I2C2_ER_C0_IRQHandler(void);
void    I2C3_EV_C0_IRQHandler(void);
void    I2C3_ER_C0_IRQHandler(void);
void    I3C1_EV_C0_IRQHandler(void);
void    I3C1_ER_C0_IRQHandler(void);
void    I3C2_EV_C0_IRQHandler(void);
void    I3C2_ER_C0_IRQHandler(void);
void    TIM1_BRK_C0_IRQHandler(void);
void    TIM1_UP_C0_IRQHandler(void);
void    TIM1_TRG_COM_C0_IRQHandler(void);
void    TIM1_CC_C0_IRQHandler(void);
void    TIM2_C0_IRQHandler(void);
void    TIM3_C0_IRQHandler(void);
void    TIM4_C0_IRQHandler(void);
void    TIM5_C0_IRQHandler(void);
void    TIM6_C0_IRQHandler(void);
void    TIM7_C0_IRQHandler(void);
void    TIM8_BRK_C0_IRQHandler(void);
void    TIM8_UP_C0_IRQHandler(void);
void    TIM8_TRG_COM_C0_IRQHandler(void);
void    TIM8_CC_C0_IRQHandler(void);
void    TIM9_C0_IRQHandler(void);
void    TIM10_C0_IRQHandler(void);
void    TIM12_C0_IRQHandler(void);
void    TIM13_C0_IRQHandler(void);
void    TIM14_C0_IRQHandler(void);
void    TIM15_C0_IRQHandler(void);
void    TIM16_C0_IRQHandler(void);
void    TIM17_C0_IRQHandler(void);
void    TIM20_BRK_C0_IRQHandler(void);
void    TIM20_UP_C0_IRQHandler(void);
void    TIM20_TRG_COM_C0_IRQHandler(void);
void    TIM20_CC_C0_IRQHandler(void);
void    LPTIM1_C0_IRQHandler(void);
void    LPTIM2_C0_IRQHandler(void);
void    LPTIM3_C0_IRQHandler(void);
void    LPTIM4_C0_IRQHandler(void);
void    LPTIM5_C0_IRQHandler(void);
void    HRTIM1_M_C0_IRQHandler(void);
void    HRTIM1_TIMA_C0_IRQHandler(void);
void    HRTIM1_TIMB_C0_IRQHandler(void);
void    HRTIM1_TIMC_C0_IRQHandler(void);
void    HRTIM1_TIMD_C0_IRQHandler(void);
void    HRTIM1_TIME_C0_IRQHandler(void);
void    HRTIM1_TIMF_C0_IRQHandler(void);
void    HRTIM1_FLT_C0_IRQHandler(void);
void    ADF1_FLT0_C0_IRQHandler(void);
void    MDF1_FLT0_C0_IRQHandler(void);
void    MDF1_FLT1_C0_IRQHandler(void);
void    MDF1_FLT2_C0_IRQHandler(void);
void    MDF1_FLT3_C0_IRQHandler(void);
void    MDF1_FLT4_C0_IRQHandler(void);
void    MDF1_FLT5_C0_IRQHandler(void);
void    SAI1_A_C0_IRQHandler(void);
void    SAI1_B_C0_IRQHandler(void);
void    SAI2_A_C0_IRQHandler(void);
void    SAI2_B_C0_IRQHandler(void);
void    SPDIFRX1_C0_IRQHandler(void);
void    SPI1_C0_IRQHandler(void);
void    SPI2_C0_IRQHandler(void);
void    SPI3_C0_IRQHandler(void);
void    SPI4_C0_IRQHandler(void);
void    SPI5_C0_IRQHandler(void);
void    SPI6_C0_IRQHandler(void);
void    USART1_C0_IRQHandler(void);
void    USART2_C0_IRQHandler(void);
void    USART3_C0_IRQHandler(void);
void    UART4_C0_IRQHandler(void);
void    UART5_C0_IRQHandler(void);
void    USART6_C0_IRQHandler(void);
void    UART7_C0_IRQHandler(void);
void    UART8_C0_IRQHandler(void);
void    UART9_C0_IRQHandler(void);
void    USART10_C0_IRQHandler(void);
void    LPUART1_C0_IRQHandler(void);
void    CEC_C0_IRQHandler(void);
void    XSPI1_C0_IRQHandler(void);
void    XSPI2_C0_IRQHandler(void);
void    FMC_C0_IRQHandler(void);
void    SDMMC1_C0_IRQHandler(void);
void    SDMMC2_C0_IRQHandler(void);
void    UCPD1_C0_IRQHandler(void);
void    OTG1_C0_IRQHandler(void);
void    OTG_FS_C0_IRQHandler(void);
void    ETH1_C0_IRQHandler(void);
void    FDCAN1_IT0_C0_IRQHandler(void);
void    FDCAN1_IT1_C0_IRQHandler(void);
void    FDCAN2_IT0_C0_IRQHandler(void);
void    FDCAN2_IT1_C0_IRQHandler(void);
void    FDCAN3_IT0_C0_IRQHandler(void);
void    FDCAN3_IT1_C0_IRQHandler(void);
void    FDCAN_CU_C0_IRQHandler(void);
void    MDIOS_C0_IRQHandler(void);
void    PSSI_C0_IRQHandler(void);
void    WKUP_C0_IRQHandler(void);
void    LSECSS_C0_IRQHandler(void);
void    CORDIC_C0_IRQHandler(void);
void    FMAC_C0_IRQHandler(void);
void    HSEM_S_C0_IRQHandler(void);
void    HSEM__C0_IRQHandler(void);
void    CTI_IT0_C0_IRQHandler(void);
void    CTI_IT1_C0_IRQHandler(void);
void    CRS_C0_IRQHandler(void);
void    SBS_S_C0_IRQHandler(void);
void    SBS_C0_IRQHandler(void);

#if (defined(__cplusplus))
}
#endif
